function getCurrentSeason() {
    // It's plus one because January is index 0
    const now = new Date();
    const month = now.getMonth() + 1;

    if (month > 3 && month < 6) {
        return  '🌱';
    }

    if (month > 6 && month < 9) {
        return '🌞';
    }

    if (month > 9 && month < 12) {
        return '🍁';
    }

    if (month >= 1 && month < 3) {
        return '☃️';
    }
}

export const msgTemplate = (date, picked, thema, recall, learn, hw ) => {

    let currentSeason = getCurrentSeason()

    let absentMsg = ''
    if (picked.length === 0) {
        absentMsg = ''
    } else if (picked.length > 1) {
        absentMsg = `\nНа онлайн-уроці були відсутні: ${picked.join(', ')}\n
Запрошую цих учнів прийти на наступний урок за півгодини раніше для відпрацювання теми, яку було пропущено.⏳
А також постарайтеся вирішити кілька завдань за новою темою.\n
Важливо, Якщо ви плануєте прийти на відпрацювання, відпишіть підтвердження у відповідному смс. Тільки так ми можемо розраховувати на вашу присутність. А також спланувати відпрацювання в нашому розкладі. Дякую! 
`
    } else if (picked.length === 1) {
        absentMsg = `\nНа онлайн-уроці був відсутній учень ${picked.join(', ')}\n
Запрошую цього учня прийти на наступний урок за півгодини раніше для відпрацювання теми, яку було пропущено.⏳
А також постарайся вирішити кілька завдань за новою темою.\n
Важливо, Якщо ви плануєте прийти на відпрацювання, відпишіть підтвердження у відповідному смс. Тільки так ми можемо розраховувати на вашу присутність. А також спланувати відпрацювання в нашому розкладі. Дякую! 
`
    }
    const finalMsg = `
Доброго дня, шановні батьки${currentSeason}
${absentMsg}\n
💡 ${date.toLocaleDateString()} була пройдена тема: ${thema}
${recall===''?'':`Ми пригадали, ${recall.toLowerCase()}`}
${learn===''?'':`Ми вивчили, ${learn.toLowerCase()}`}

📕 ДОМАШНЯ ПРАКТИКА:\n
${hw}

❗️ Нагадую, що практику потрібно зробити до п\'ятниці. А також не забуваємо ставити запитання, якщо щось не зрозуміло, в онлайн чаті на платформі.
🕕 У середу о 18:00 я почну відповідати на всі питання, що задавали учні!

Усім продуктивного тижня!${currentSeason}

З повагою, Богдан - викладач ІТ школи Logika
Все буде Україна🇺🇦
💛💙`
    return finalMsg
}
